blog/2017/02/07/best_tools/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>Best Tools - org-page</title>
  <meta charset="utf-8" />
  <meta name="author" content="latpaw" />
  <meta name="description" content="&lt;TODO: insert your description here&gt;" />
  <meta name="keywords" content="&lt;TODO: insert your keywords here&gt;" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">
</head>

  <body class="container">
<header id="header">
<body>
    <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
        <div class="container-fluid">
<div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">org-page</a>
        </div>
<div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">
                <li class="active"><a href="/">Blog</a></li>
          <li><a href="https://github.com/latpaw">GitHub</a></li>
        </ul>
</div>
</div>
    </nav>
</body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>Best Tools</h1>
            <div id="outline-container-org81beb89" class="outline-2">
<h2 id="org81beb89">MAC</h2>
<div class="outline-text-2" id="text-org81beb89">
</div><div id="outline-container-orgd444d86" class="outline-3">
<h3 id="orgd444d86">alfred&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tools">tools</span></span></h3>
</div>
<div id="outline-container-orgbdb1e63" class="outline-3">
<h3 id="orgbdb1e63"><a href="vim.html">vim/mvim</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="editor">editor</span></span></h3>
</div>
<div id="outline-container-org4e3d2ea" class="outline-3">
<h3 id="org4e3d2ea"><a href="emacs.html">emacs</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="editor">editor</span></span></h3>
</div>
<div id="outline-container-orgddd533d" class="outline-3">
<h3 id="orgddd533d">atom&#xa0;&#xa0;&#xa0;<span class="tag"><span class="editor">editor</span></span></h3>
</div>
<div id="outline-container-orgff6e89d" class="outline-3">
<h3 id="orgff6e89d">xcode&#xa0;&#xa0;&#xa0;<span class="tag"><span class="editor">editor</span></span></h3>
<div class="outline-text-3" id="text-orgff6e89d">
</div><div id="outline-container-org4f3bd4f" class="outline-4">
<h4 id="org4f3bd4f">cocoapod</h4>
<div class="outline-text-4" id="text-org4f3bd4f">
</div><div id="outline-container-orgcb36d6c" class="outline-5">
<h5 id="orgcb36d6c">canvas</h5>
</div>
</div>
</div>
<div id="outline-container-org6edde1a" class="outline-3">
<h3 id="org6edde1a">vs code&#xa0;&#xa0;&#xa0;<span class="tag"><span class="editor">editor</span></span></h3>
</div>
<div id="outline-container-org0a96ae2" class="outline-3">
<h3 id="org0a96ae2">sublime&#xa0;&#xa0;&#xa0;<span class="tag"><span class="editor">editor</span></span></h3>
</div>
<div id="outline-container-org80c8348" class="outline-3">
<h3 id="org80c8348">homebrew&#xa0;&#xa0;&#xa0;<span class="tag"><span class="manager">manager</span></span></h3>
<div class="outline-text-3" id="text-org80c8348">
</div><div id="outline-container-org6c6548d" class="outline-4">
<h4 id="org6c6548d">Brewfile</h4>
<div class="outline-text-4" id="text-org6c6548d">
<p>
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/games'
tap 'homebrew/nginx'
tap 'homebrew/php'
tap 'homebrew/science'
tap 'homebrew/services'
tap 'homebrew/x11'
tap 'neovim/neovim'
cask 'xquartz'
brew 'ack'
brew 'libyaml'
brew 'openssl'
brew 'ansible'
brew 'apg'
brew 'go'
brew 'asciinema'
brew 'autoconf'
brew 'xz'
brew 'automake'
brew 'icu4c'
brew 'boost'
brew 'cmake'
brew 'geoipupdate'
brew 'geoip'
brew 'bro'
brew 'pkg-config'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'gettext'
brew 'libffi'
brew 'glib'
brew 'cairo'
brew 'ccat'
brew 'cheat'
brew 'cmatrix'
brew 'ctags'
brew 'dateutils'
brew 'libgpg-error'
brew 'libassuan'
brew 'libgcrypt'
brew 'libksba'
brew 'pth'
brew 'dirmngr'
brew 'docker'
brew 'docker-machine'
brew 'libtasn1'
brew 'gmp'
brew 'nettle'
brew 'gnutls'
brew 'jpeg'
brew 'libtiff'
brew 'gobject-introspection'
brew 'gdk-pixbuf'
brew 'libcroco'
brew 'harfbuzz'
brew 'pango'
brew 'librsvg'
brew 'emacs'
brew 'libtool'
brew 'wxmac'
brew 'erlang'
brew 'etcd'
brew 'fasd'
brew 'fdupes'
brew 'readline'
brew 'sqlite'
brew 'gdbm'
brew 'python'
brew 'yasm'
brew 'x264'
brew 'lame'
brew 'xvid'
brew 'ffmpeg'
brew 'fish'
brew 'fpp'
brew 'mpfr'
brew 'libmpc'
brew 'isl'
brew 'gcc'
brew 'gd'
brew 'git-flow'
brew 'global'
brew 'pinentry'
brew 'gpg-agent'
brew 'libusb'
brew 'libusb-compat'
brew 'gnupg2'
brew 'lua'
brew 'gnuplot'
brew 'goaccess'
brew 'grc'
brew 'htop-osx'
brew 'httpie'
brew 'hub'
brew 'iftop'
brew 'iproute2mac'
brew 'irssi'
brew 'jansson'
brew 'libev'
brew 'libevent'
brew 'libressl'
brew 'libvo-aacenc'
brew 'libxml2'
brew 'links'
brew 'pcre'
brew 'lnav'
brew 'lynis'
brew 'mackup'
brew 'protobuf'
brew 'mobile-shell'
brew 'scons'
brew 'mongodb'
brew 's-lang'
brew 'most'
brew 'mtr'
brew 'mysql'
brew 'ncdu'
brew 'netcat'
brew 'spdylay'
brew 'python3'
brew 'nghttp2'
brew 'ngrep'
brew 'nmap'
brew 'node'
brew 'peco'
brew 'proxychains-ng'
brew 'pstree'
brew 'rabbitmq'
brew 'shellcheck'
brew 'spark'
brew 'the_platinum_searcher'
brew 'the_silver_searcher'
brew 'thrift'
brew 'tig'
brew 'tmux'
brew 'tmux-cssh'
brew 'tree'
brew 'unixodbc'
brew 'vim'
brew 'weechat'
brew 'wget'
brew 'youtube-dl'
brew 'caskroom/cask/brew-cask'
brew 'homebrew/nginx/openresty'
brew 'homebrew/php/php70'
brew 'homebrew/php/boris'
brew 'homebrew/science/r'
brew 'homebrew/x11/mit-scheme'
brew 'neovim/neovim/neovim'
cask 'electron'
cask 'facter'
cask 'haskell-platform'
cask 'karabiner'
cask 'keycastr'
cask 'madruby'
cask 'mesasqlite'
cask 'puppet'
cask 'rubymine'
cask 'seil'
cask 'sequel-pro'
cask 'sketch'
cask 'sketch-toolbox'
cask 'techstoreclub-simple-comic'
cask 'virtualbox'
cask 'wireshark'
</p>
</div>
</div>
</div>

<div id="outline-container-orgb134ce1" class="outline-3">
<h3 id="orgb134ce1">sketch&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tools">tools</span></span></h3>
<div class="outline-text-3" id="text-orgb134ce1">
</div><div id="outline-container-orgb7b29c1" class="outline-4">
<h4 id="orgb7b29c1">content generator</h4>
</div>
<div id="outline-container-org3511818" class="outline-4">
<h4 id="org3511818">cssketch</h4>
</div>
<div id="outline-container-org49e5f84" class="outline-4">
<h4 id="org49e5f84">icon font</h4>
</div>
</div>
<div id="outline-container-orgbe6ad25" class="outline-3">
<h3 id="orgbe6ad25">sketch toolbox</h3>
</div>
<div id="outline-container-orga4307f2" class="outline-3">
<h3 id="orga4307f2">keycastr</h3>
</div>
<div id="outline-container-orge069113" class="outline-3">
<h3 id="orge069113">karabiner</h3>
</div>
<div id="outline-container-orgf7f0169" class="outline-3">
<h3 id="orgf7f0169">seil</h3>
</div>
<div id="outline-container-orgd691361" class="outline-3">
<h3 id="orgd691361">mesasqlite</h3>
</div>
<div id="outline-container-org4deaeef" class="outline-3">
<h3 id="org4deaeef">sequel pro</h3>
</div>
<div id="outline-container-org58f9a5c" class="outline-3">
<h3 id="org58f9a5c">electron</h3>
</div>
<div id="outline-container-orgc09413d" class="outline-3">
<h3 id="orgc09413d">mongohub</h3>
</div>
<div id="outline-container-orgfee9179" class="outline-3">
<h3 id="orgfee9179">postman</h3>
</div>
<div id="outline-container-orgdc098be" class="outline-3">
<h3 id="orgdc098be">slack</h3>
</div>
<div id="outline-container-org4a133b4" class="outline-3">
<h3 id="org4a133b4">manico</h3>
</div>
<div id="outline-container-orgd9aa3e6" class="outline-3">
<h3 id="orgd9aa3e6">appcleaner</h3>
</div>
<div id="outline-container-orge2ff436" class="outline-3">
<h3 id="orge2ff436">dash</h3>
</div>
<div id="outline-container-orgeffedb0" class="outline-3">
<h3 id="orgeffedb0">bartender</h3>
</div>
<div id="outline-container-org15a83df" class="outline-3">
<h3 id="org15a83df">moom</h3>
</div>
<div id="outline-container-org064314b" class="outline-3">
<h3 id="org064314b">go2shell</h3>
</div>
<div id="outline-container-orgc93b338" class="outline-3">
<h3 id="orgc93b338">shuttle</h3>
</div>
<div id="outline-container-org3f798ac" class="outline-3">
<h3 id="org3f798ac">unclutter</h3>
</div>
<div id="outline-container-org04213e4" class="outline-3">
<h3 id="org04213e4">bettertouchtool</h3>
</div>
<div id="outline-container-orgc0ce97f" class="outline-3">
<h3 id="orgc0ce97f">gif keyboard</h3>
</div>
<div id="outline-container-org82fd872" class="outline-3">
<h3 id="org82fd872">charles</h3>
</div>
<div id="outline-container-orgb1372ff" class="outline-3">
<h3 id="orgb1372ff">flux</h3>
</div>
<div id="outline-container-orgcfb2ae7" class="outline-3">
<h3 id="orgcfb2ae7">infinit</h3>
</div>
<div id="outline-container-org3417b68" class="outline-3">
<h3 id="org3417b68">amphetamine</h3>
</div>
<div id="outline-container-org553976a" class="outline-3">
<h3 id="org553976a">handbrake</h3>
</div>
<div id="outline-container-orgbfe9d28" class="outline-3">
<h3 id="orgbfe9d28">hype3</h3>
</div>
<div id="outline-container-orge442676" class="outline-3">
<h3 id="orge442676">paw</h3>
</div>
<div id="outline-container-org33accbf" class="outline-3">
<h3 id="org33accbf">1password</h3>
</div>
<div id="outline-container-org38577d4" class="outline-3">
<h3 id="org38577d4">lastpass</h3>
</div>
<div id="outline-container-org2847e4d" class="outline-3">
<h3 id="org2847e4d">bittorrent</h3>
</div>
<div id="outline-container-org10fdfd5" class="outline-3">
<h3 id="org10fdfd5">bittorrent sync</h3>
</div>
<div id="outline-container-org8562850" class="outline-3">
<h3 id="org8562850">thor</h3>
</div>
</div>

    </div>
</section>


<footer id="footer">
    <br />
</footer>

  </body>
</html>
